In [1]:
## Importing the libraries for data cleaning

import pandas as pd

In [22]:
## Importing the data 

df = pd.read_csv("C:/Users/sujay/OneDrive/Desktop/US Cars Data.csv")
df.head()

,Brand,Model,Year,Status,Mileage,Dealer,Price
0,Mazda,CX-5,2023,New,NaN,NaN,36703.0
1,Kia,Sportage,2023,New,NaN,Classic Kia,28990.0
2,Chevrolet,Camaro,2024,New,NaN,Classic Chevrolet Beaumont,41425.0
3,Ford,Bronco,2023,Used,1551.0,Mike Smith Chrysler Dodge Jeep RAM,58900.0
4,Acura,TLX,2021,Used,30384.0,Mike Smith Nissan,34499.0

In [23]:
## Checking for null values in the data set

df.isnull().sum()

Brand          0
Model          0
Year           0
Status         0
Mileage    88953
Dealer       328
Price       3911
dtype: int64

In [24]:
## Replacing the missing values in "Mileage" and "Dealer" columns respectively with "Not Available"

df[["Mileage","Dealer"]]=df[["Mileage","Dealer"]].fillna("Not Available")

In [25]:
## To check the data types 

df.dtypes

Brand       object
Model       object
Year         int64
Status      object
Mileage     object
Dealer      object
Price      float64
dtype: object

In [29]:
## Replacing the missing values in the "Price" column with the "mean" value

df['Price'].fillna(df['Price'].mean(), inplace=True)

In [30]:
## Checking for null values

df.isnull().sum()

Brand      0
Model      0
Year       0
Status     0
Mileage    0
Dealer     0
Price      0
dtype: int64

In [31]:
df['Price'] = df['Price'].astype(int)

In [32]:
df.dtypes

Brand      object
Model      object
Year        int64
Status     object
Mileage    object
Dealer     object
Price       int32
dtype: object

In [33]:
df

,Brand,Model,Year,Status,Mileage,Dealer,Price
0,Mazda,CX-5,2023,New,Not Available,Not Available,36703
1,Kia,Sportage,2023,New,Not Available,Classic Kia,28990
2,Chevrolet,Camaro,2024,New,Not Available,Classic Chevrolet Beaumont,41425
3,Ford,Bronco,2023,Used,1551.0,Mike Smith Chrysler Dodge Jeep RAM,58900
4,Acura,TLX,2021,Used,30384.0,Mike Smith Nissan,34499
...,...,...,...,...,...,...,...
144862,Chevrolet,Corvette,2023,New,Not Available,Chase Chevrolet,122455
144863,Chevrolet,Corvette,2023,New,Not Available,Chase Chevrolet,125930
144864,Jeep,Wrangler,2023,New,Not Available,Stockton Dodge Chrysler Jeep RAM,53715
144865,Jeep,Wrangler,2023,New,Not Available,Stockton Dodge Chrysler Jeep RAM,91450
144866,Chrysler,300,2023,New,Not Available,Stockton Dodge Chrysler Jeep RAM,52000

In [20]:
df.duplicated().sum()b

5389

In [41]:
df.shape

(144867, 7)

In [36]:
new_df = df.drop_duplicates(keep=False)

In [38]:
new_df.duplicated().sum()

0

In [39]:
new_df

,Brand,Model,Year,Status,Mileage,Dealer,Price
0,Mazda,CX-5,2023,New,Not Available,Not Available,36703
1,Kia,Sportage,2023,New,Not Available,Classic Kia,28990
2,Chevrolet,Camaro,2024,New,Not Available,Classic Chevrolet Beaumont,41425
3,Ford,Bronco,2023,Used,1551.0,Mike Smith Chrysler Dodge Jeep RAM,58900
4,Acura,TLX,2021,Used,30384.0,Mike Smith Nissan,34499
...,...,...,...,...,...,...,...
144862,Chevrolet,Corvette,2023,New,Not Available,Chase Chevrolet,122455
144863,Chevrolet,Corvette,2023,New,Not Available,Chase Chevrolet,125930
144864,Jeep,Wrangler,2023,New,Not Available,Stockton Dodge Chrysler Jeep RAM,53715
144865,Jeep,Wrangler,2023,New,Not Available,Stockton Dodge Chrysler Jeep RAM,91450
144866,Chrysler,300,2023,New,Not Available,Stockton Dodge Chrysler Jeep RAM,52000

In [40]:
new_df.isnull().sum()

Brand      0
Model      0
Year       0
Status     0
Mileage    0
Dealer     0
Price      0
dtype: int64

In [42]:
new_df.shape

(135618, 7)

In [44]:
new_df.to_csv('cleaned_car_sales_data.csv', index=False)